export const DAY_TYPE = ['උදෑසන', 'දිවා', 'සවස', 'රාත්‍රී'];
export const ESTIMATED_FOOD = [10, 15, 8, 13]; // morning, afternoon, evening, night - times
export const ESTIMATED_PLAY = [20, 20, 30, 15]; // morning, afternoon, evening, night - times
export const SKILL_LEVEL = ['දුර්වලයි', 'මධ්‍යස්තයි', 'ඉහලයි'];
export const COMPILATION_LEVEL = [
  'තනිව පටන් ගන්නේ නැත',
  'අඩක් සම්පූර්ණයි',
  'සම්පූර්ණයි',
];
export const CLEAN_TYPE = ['කාමර පිරිසිදු කිරීම', 'ඇඟ සේදීම'];
export const ESTIMATED_CLEAN = [15, 10]; // morning, afternoon, evening, night - times

export const WEEK_DAYS = [
  'සඳුදා',
  'අඟහරුවාදා',
  'බදාදා',
  'බ්‍රහස්පතින්දා',
  'සිකුරාදා',
  'සෙනසුරාදා',
  'ඉරිදා',
];

// Games
export const GAME_TYPE = [
  'වස්තුන් සොයමු',
  'අංක කරමු',
  'මතක සෙල්ලම',
  'පිංතුර ගලපමු',
];

export const ACTIVITY_RECORMMEND = [
  {
    breakfast:
      'දරුවාට ආහාර ගැනීම පහසු සහ වේගවත් කිරීම සඳහා කුඩා, කළමනාකරණය කළ හැකි කැබලිවලට ආහාර කපන්න. සංවේදී ගැටළු සලකා බලන්න (සෞඛ්‍ය සේවා වෘත්තිකයන්ගේ උපකාර ලබා ගන්න.)',
    m_play:
      'විවේකය සහ ස්වයං දැනුවත්භාවය ප්‍රවර්ධනය කරන සිහිකල්පනාව ක්‍රියාකාරකම් හඳුන්වා දෙන්න. යෝග, ගැඹුරු හුස්ම ගැනීමේ අභ්‍යාස සහ මාර්ගෝපදේශ භාවනාව වැනි ක්‍රියාකාරකම්. ව්‍යුහගත ක්‍රීඩා ක්‍රියාකාරකම් සඳහා අවස්ථා ලබා දීම උදාහරණ ලෙස පුවරු ක්‍රීඩා, ප්‍රහේලිකා සහ ගොඩනැඟිලි කොටස් ඇතුළත් වේ.',
    lunch:
      'දරුවාට ආහාර ගැනීම පහසු සහ වේගවත් කිරීම සඳහා කුඩා, කළමනාකරණය කළ හැකි කැබලිවලට ආහාර කපන්න. සංවේදී ගැටළු සලකා බලන්න (සෞඛ්‍ය සේවා වෘත්තිකයන්ගේ උපකාර ලබා ගන්න.)',
    clean:
      'දරැවා සමග එකට වැඩ කරන්න. ස්වයං අධීක්ෂණය දිරිමත් කරන්න. ගීතයක් වාදනය කරමින් ඇති විට දරැවාට කාමරය පිරිසිදු කිරිමට ඉඩ සලසන්න ',
    e_play:
      'බයිසිකල් පැදීම, ධාවනය, පැනීම සහ ක්‍රීඩා කිරීම වැනි ක්‍රියාකාරකම් කෙරෙහි විශේෂ අවධානය යොමු කරන්න. චාලක වැලි සමඟ සෙල්ලම් කිරීම, ජල ක්‍රීඩාව වැනි, ADHD සහිත දරුවන්ට ඔවුන්ගේ හැඟීම් නියාමනය කිරීමට සහ ඔවුන්ගේ සංවේදී සැකසුම් කුසලතා වැඩි දියුණු කිරීමට උපකාර කරන සෙල්ලම් සදහා යොමු වන්න. සංවේදී ගැටළු සලකා බලන්න (සෞඛ්‍ය සේවා වෘත්තිකයන්ගේ උපකාර ලබා ගන්න.)',
    bath: 'සුවපහසුව සහ හුරුපුරුදුකම ගොඩනැගීම සඳහා නාන තටාකයෙන් පිටත අත් සේදීම හෝ ජල සෙල්ලම් බඩු සමඟ සෙල්ලම් කිරීම ආරම්භ කරන්න. සන්සුන් පරිසරයක් නිර්මාණය කරන්න. ',
    dinner:
      'දරුවාට ආහාර ගැනීම පහසු සහ වේගවත් කිරීම සඳහා කුඩා, කළමනාකරණය කළ හැකි කැබලිවලට ආහාර කපන්න. සංවේදී ගැටළු සලකා බලන්න (සෞඛ්‍ය සේවා වෘත්තිකයන්ගේ උපකාර ලබා ගන්න.)',
  },
  {
    breakfast:
      'රූපවාහිනිය, ඉලෙක්ට්‍රොනික උපාංග වැනි අවධානය වෙනතකට යොමු කිරීම අඩු කිරීමෙන් සන්සුන් හා අවධානයෙන් ආහාර ගැනීමේ පරිසරයක් නිර්මාණය කරන්න. සංවේදී ගැටළු සලකා බලන්න (සෞඛ්‍ය සේවා වෘත්තිකයන්ගේ උපකාර ලබා ගන්න.)',
    m_play:
      'ව්‍යුහගත ක්‍රීඩා ක්‍රියාකාරකම් සඳහා අවස්ථා ලබා දීම උදාහරණ ලෙස පුවරු ක්‍රීඩා, ප්‍රහේලිකා සහ ගොඩනැඟිලි කොටස් ඇතුළත් වේ.',
    lunch:
      'රූපවාහිනිය, ඉලෙක්ට්‍රොනික උපාංග වැනි අවධානය වෙනතකට යොමු කිරීම අඩු කිරීමෙන් සන්සුන් හා අවධානයෙන් ආහාර ගැනීමේ පරිසරයක් නිර්මාණය කරන්න. සංවේදී ගැටළු සලකා බලන්න (සෞඛ්‍ය සේවා වෘත්තිකයන්ගේ උපකාර ලබා ගන්න.)',
    clean: 'දරැවා සමග එකට වැඩ කරන්න. පැහැදිලි උපදෙස් ලබා දෙන්න (අදියර වශයෙන්)',
    e_play:
      'චාලක වැලි සමඟ සෙල්ලම් කිරීම, ජල ක්‍රීඩාව වැනි, ADHD සහිත දරුවන්ට ඔවුන්ගේ හැඟීම් නියාමනය කිරීමට සහ ඔවුන්ගේ සංවේදී සැකසුම් කුසලතා වැඩි දියුණු කිරීමට උපකාර කරන සෙල්ලම් සදහා යොමු වන්න. සංවේදී ගැටළු සලකා බලන්න (සෞඛ්‍ය සේවා වෘත්තිකයන්ගේ උපකාර ලබා ගන්න.)',
    bath: 'නාන සෙල්ලම් බඩු හෝ ක්රීඩා භාවිතා කරන්න',
    dinner:
      'රූපවාහිනිය, ඉලෙක්ට්‍රොනික උපාංග වැනි අවධානය වෙනතකට යොමු කිරීම අඩු කිරීමෙන් සන්සුන් හා අවධානයෙන් ආහාර ගැනීමේ පරිසරයක් නිර්මාණය කරන්න. සංවේදී ගැටළු සලකා බලන්න (සෞඛ්‍ය සේවා වෘත්තිකයන්ගේ උපකාර ලබා ගන්න.)',
  },
  {
    breakfast:
      'සෞඛ්‍ය සම්පන්න ආහාර පුරුදු ඔබම නිරූපණය කිරීමෙන් ධනාත්මක ආදර්ශයක් තබන්න.',
    m_play: 'කරුණාකර ළමුන් සඳහා යෝග ඉරියව් හෝ සරල භාවනා ක්‍රම භාවිතා කරන්න.',
    lunch:
      'සෞඛ්‍ය සම්පන්න ආහාර පුරුදු ඔබම නිරූපණය කිරීමෙන් ධනාත්මක ආදර්ශයක් තබන්න.',
    clean: 'පැහැදිලි උපදෙස් ලබා දෙන්න (අදියර වශයෙන්)',
    e_play: 'දරැවා සමග එකට සෙල්ලම් කරන්න',
    bath: 'සන්සුන් පරිසරයක් නිර්මාණය කරන්න. ',
    dinner:
      'සෞඛ්‍ය සම්පන්න ආහාර පුරුදු ඔබම නිරූපණය කිරීමෙන් ධනාත්මක ආදර්ශයක් තබන්න.',
  },
  {
    breakfast:
      'සෞඛ්‍ය සම්පන්න ආහාර පුරුදු ඔබම නිරූපණය කිරීමෙන් ධනාත්මක ආදර්ශයක් තබන්න.',
    m_play:
      'ස්ථාපිත චර්යාව අනුගමනය කිරීමට සහ ස්වාධීනව කාර්යයන් සම්පූර්ණ කිරීමට ඔවුන්ගේ හැකියාව විශ්වාස කරමින් අවම මග පෙන්වීමක් සහ අධීක්ෂණයක් ලබා දෙන්න.',
    lunch:
      'සෞඛ්‍ය සම්පන්න ආහාර පුරුදු ඔබම නිරූපණය කිරීමෙන් ධනාත්මක ආදර්ශයක් තබන්න.',
    clean: 'දරැවා සමග එකට වැඩ කරන්න',
    e_play: 'දරැවා සමග එකට සෙල්ලම් කරන්න',
    bath: 'ස්ථාපිත චර්යාව අනුගමනය කිරීමට සහ ස්වාධීනව කාර්යයන් සම්පූර්ණ කිරීමට ඔවුන්ගේ හැකියාව විශ්වාස කරමින් අවම මග පෙන්වීමක් සහ අධීක්ෂණයක් ලබා දෙන්න.',
    dinner:
      'සෞඛ්‍ය සම්පන්න ආහාර පුරුදු ඔබම නිරූපණය කිරීමෙන් ධනාත්මක ආදර්ශයක් තබන්න.',
  },
];

export const GAME_RECORMMEND = [
  [
    'ක්‍රීඩාව කරන අතරතුර නිහඬ සංවිධානාත්මක පරිසරයක් සකසා දෙන්න.',
    'චලනය කිරීමට හෝ ශක්තිය මුදාහැරීම සදහා ක්‍රීඩා සැසි අතර,නිතර කෙටි විරාම ක්‍රියාත්මක කරන්න.',
    'ක්‍රීඩාවන්හි නිරත වන සෑම අවස්ථාවන්හිදීම දිරිගැන්වීමක් ලබා දෙන්න.',
    'සුවපහසු පරිසරයක් නිර්මාණය කරන්න: දරුවාගේ ක්‍රීඩා පරිසරය සුවපහසු සහ අවධානය යොමු කිරීමට හිතකර බව සහතික කර ගන්න. මෙයට ආධාරක පුටුවක්, හොඳ ආලෝකයක් සහ අවට ප්රදේශයේ අවම බාධා කිරීම් ඇතුළත් වේ.',
    'අසාර්ථක වීම් ඉගෙනීමට සහ වර්ධනයට ඇති අවස්ථා ලෙස සමරමින්, අභියෝගවලට මුහුණ දීමෙන් විඳදරාගැනීමට සහ අනුවර්තනය වීමට දරුවා දිරිමත් කිරීම මගින් වර්ධන මානසිකත්වයක් සහ ඔරොත්තු දීමේ හැකියාවක් ඇති කරන්න',
    'එළිමහන් ක්‍රීඩාව දිරිමත් කරන්න: යෙදුම භාවිතා කිරීමට පෙර හෝ පසුව එළිමහන් ක්‍රීඩා හෝ ශාරීරික ක්‍රියාකාරකම්වල යෙදීමට දරුවා දිරිමත් කරන්න. ශාරීරික ව්‍යායාම මඟින් අධි ක්‍රියාකාරීත්වය අඩු කිරීමට සහ අවධානය සහ ආවේග පාලනය වැඩි දියුණු කිරීමට උපකාරී වන අතර, දරුවාට යෙදුම සමඟ සම්බන්ධ වීම පහසු කරයි.',
    'අවධානය වෙනතකට යොමු කිරීම අවම කිරීමට සහ ශබ්දය අවලංගු කරන headphones වැනි උපාය මාර්ග භාවිතා කරන්න.',
  ],
  [
    'ක්‍රීඩාව කරන අතරතුර නිහඬ සංවිධානාත්මක පරිසරයක් සකසා දෙන්න.',
    'චලනය කිරීමට හෝ ශක්තිය මුදාහැරීම සදහා ක්‍රීඩා සැසි අතර,නිතර කෙටි විරාම ක්‍රියාත්මක කරන්න.',
    'ක්‍රීඩාවන්හි නිරත වන සෑම අවස්ථාවන්හිදීම දිරිගැන්වීමක් ලබා දෙන්න.',
    'සුවපහසු පරිසරයක් නිර්මාණය කරන්න: දරුවාගේ ක්‍රීඩා පරිසරය සුවපහසු සහ අවධානය යොමු කිරීමට හිතකර බව සහතික කර ගන්න. මෙයට ආධාරක පුටුවක්, හොඳ ආලෝකයක් සහ අවට ප්රදේශයේ අවම බාධා කිරීම් ඇතුළත් වේ.',
    'අසාර්ථක වීම් ඉගෙනීමට සහ වර්ධනයට ඇති අවස්ථා ලෙස සමරමින්, අභියෝගවලට මුහුණ දීමෙන් විඳදරාගැනීමට සහ අනුවර්තනය වීමට දරුවා දිරිමත් කිරීම මගින් වර්ධන මානසිකත්වයක් සහ ඔරොත්තු දීමේ හැකියාවක් ඇති කරන්න. එළිමහන් ක්‍රීඩාව දිරිමත් කරන්න: යෙදුම භාවිතා කිරීමට පෙර හෝ පසුව එළිමහන් ක්‍රීඩා හෝ ශාරීරික ',
    'ක්‍රියාකාරකම්වල යෙදීමට දරුවා දිරිමත් කරන්න. ශාරීරික ව්‍යායාම මඟින් අධි ක්‍රියාකාරීත්වය අඩු කිරීමට සහ අවධානය සහ ආවේග පාලනය වැඩි දියුණු කිරීමට උපකාරී වන අතර, දරුවාට යෙදුම සමඟ සම්බන්ධ වීම පහසු කරයි.',
    'ක්‍රීඩාව අතරතුර මතකය නැවත කැඳවීමට සහාය වීමට ඉඟි ඉදිරිපත් කරන්න.',
    'අවධානය වෙනතකට යොමු කිරීම අවම කිරීමට සහ ශබ්දය අවලංගු කරන headphones වැනි උපාය මාර්ග භාවිතා කරන්න.',
  ],
  [
    'ක්‍රීඩාව කරන අතරතුර නිහඬ සංවිධානාත්මක පරිසරයක් සකසා දෙන්න.',
    'සුවපහසු පරිසරයක් නිර්මාණය කරන්න: දරුවාගේ ක්‍රීඩා පරිසරය සුවපහසු සහ අවධානය යොමු කිරීමට හිතකර බව සහතික කර ගන්න. මෙයට ආධාරක පුටුවක්, හොඳ ආලෝකයක් සහ අවට ප්රදේශයේ අවම බාධා කිරීම් ඇතුළත් වේ. ',
    'අධ්‍යාපනික සංකල්ප ශක්තිමත් කිරීම සඳහා සත්ව චලනයන් අනුකරණය කිරීම හෝ නර්තන චර්යාවන් වැනි චාලක ඉගෙනුම් ක්‍රියාකාරකම් ඇතුළත් කරන්න.',
    'දරුවාට තම රුචිකත්වයන් සහ කුතුහලය ලුහුබැඳීමට ඉඩ සලසමින් ක්‍රීඩා පරිසරය තුළ ස්වයං අධ්‍යාපනය සහ ගවේෂණය සඳහා අවස්ථා ලබා දෙන්න.',
    'ඉගෙනීමේ ප්‍රගතිය පිළිබඳ ස්වයං තක්සේරුව සහ පරාවර්තනය සඳහා අවස්ථා ලබා දීම, දරුවාට ඉලක්ක තැබීමට සහ ඔවුන්ගේ ජයග්‍රහණ නිරීක්ෂණය කිරීමට ඉඩ සලසන්න',
    'ක්‍රීඩාව කරන අතරතුර නිහඬ සංවිධානාත්මක පරිසරයක් සකසා දෙන්න.',
    'අවධානය වෙනතකට යොමු කිරීම අවම කිරීමට සහ ශබ්දය අවලංගු කරන headphones වැනි උපාය මාර්ග භාවිතා කරන්න',
    'ක්‍රීඩාව අතරතුර මතකය නැවත කැඳවීමට සහාය වීමට ඉඟි හෝ ඉඟි ඉදිරිපත් කරන්න.',
  ],
  [
    'දරුවාට තම රුචිකත්වයන් සහ කුතුහලය ලුහුබැඳීමට ඉඩ සලසමින් ක්‍රීඩා පරිසරය තුළ ස්වයං අධ්‍යාපනය සහ ගවේෂණය සඳහා අවස්ථා ලබා දෙන්න.',
    'ඉගෙනීමේ ප්‍රගතිය පිළිබඳ ස්වයං තක්සේරුව සහ පරාවර්තනය සඳහා අවස්ථා ලබා දීම, දරුවාට ඉලක්ක තැබීමට සහ ඔවුන්ගේ ජයග්‍රහණ නිරීක්ෂණය කිරීමට ඉඩ සලසන්න',
    'ක්‍රීඩාව තුළ ඉගෙන ගත් සංකල්පවල අදාළත්වය සහ වැදගත්කම ශක්තිමත් කිරීම සඳහා සැබෑ ලෝක සම්බන්ධතා හෝ යෙදුම් ලබා දෙන්න.',
    'අධ්‍යාපනික සංකල්ප ශක්තිමත් කිරීම සඳහා සත්ව චලනයන් අනුකරණය කිරීම හෝ නර්තන චර්යාවන් වැනි චාලක ඉගෙනුම් ක්‍රියාකාරකම් ඇතුළත් කරන්න.',
    'අභියෝග විසඳීමට සහ අරමුණු සාක්ෂාත් කර ගැනීමට දරුවාට සම වයසේ මිතුරන් සමඟ වැඩ කළ හැකි සහයෝගී ක්‍රීඩා ක්‍රම හඳුන්වා දෙන්න.',
  ],
  [
    'දරුවාට තම රුචිකත්වයන් සහ කුතුහලය ලුහුබැඳීමට ඉඩ සලසමින් ක්‍රීඩා පරිසරය තුළ ස්වයං අධ්‍යාපනය සහ ගවේෂණය සඳහා අවස්ථා ලබා දෙන්න.',
    'ඉගෙනීමේ ප්‍රගතිය පිළිබඳ ස්වයං තක්සේරුව සහ පරාවර්තනය සඳහා අවස්ථා ලබා දීම, දරුවාට ඉලක්ක තැබීමට සහ ඔවුන්ගේ ජයග්‍රහණ නිරීක්ෂණය කිරීමට ඉඩ සලසන්න',
    'ක්‍රීඩාව තුළ ඉගෙන ගත් සංකල්පවල අදාළත්වය සහ වැදගත්කම ශක්තිමත් කිරීම සඳහා සැබෑ ලෝක සම්බන්ධතා හෝ යෙදුම් ලබා දෙන්න.',
    'ප්‍රතිචාර දැක්වීමේ වේලාවන් සහ නියැලීම වැඩිදියුණු කිරීම සඳහා කාලානුරූපී අභියෝග හෝ ක්‍රීඩාවන් හඳුන්වා දෙන්න.',
    'අභියෝග විසඳීමට සහ අරමුණු සාක්ෂාත් කර ගැනීමට දරුවාට සම වයසේ මිතුරන් සමඟ වැඩ කළ හැකි සහයෝගී ක්‍රීඩා ක්‍රම හඳුන්වා දෙන්න.',
  ],
];
